       IDENTIFICATION DIVISION.       
      *ONLY MANDATORY PARAGRAPH 
       PROGRAM-ID. PROGRAM-STRUCTURE-SAMPLE.
      *OPTIONAL PARAGRAPHS  
       AUTHOR. EDUARDO FERIA.
       INSTALLATION. JUST MY COMPUTER.
       DATE-WRITTEN. MAY 12TH, 2025.
       DATE-COMPILED. MAY 12TH, 2025..
       SECURITY. NON-CONFIDENTIAL.