       IDENTIFICATION DIVISION. 
       PROGRAM-ID. HELLO_WORLD.
       AUTHOR.     Eduardo Feria.
      *This is a comment in COBOL. 

       ENVIRONMENT DIVISION.

       DATA DIVISION.

       PROCEDURE DIVISION.
      *THE DISPLAY VERB PRINTS IN THE TERMINAL 
           DISPLAY "HELLO WORLD!"
      *STOP RUN STOPS THE EXECUTION OF THE PROGRAM
       STOP RUN.
           
       END PROGRAM HELLO_WORLD.
       