       IDENTIFICATION DIVISION.
       PROGRAM-ID. ACCEPT-DISPLAY-EXAMPLE.
       AUTHOR. EDUARDO FERIA.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NICK-NAME PIC A(20).
       
       PROCEDURE DIVISION.
      *THE ACCEPT VERB RECEIVES AND SAVES AN INPUT FROM THE TERMINAL
      *WITH NO ADVANCING STOPS THE CURSOR FROM GOING TO THE NEXT LINE
       DISPLAY "HOW DO YOUR FRIENDS CALL YOU? " WITH NO ADVANCING.
       ACCEPT NICK-NAME.
       DISPLAY "NICE TO MEET YOU " NICK-NAME.

       STOP RUN.
       