       IDENTIFICATION DIVISION.
       PROGRAM-ID. VARIABLE-DEFINITION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NUMBER-A PIC 9(1) VALUE 15.
       01 WS-NUMBER-B PIC 9(2) VALUE 15.
       01 WS-NUMBER-C PIC 9(4) VALUE 15.
       01 WS-NUMBER-D PIC 9(4) VALUE "15A".

       01 WS-WORD-A PIC A(3) VALUE "SHORT".
       01 WS-WORD-B PIC A(5) VALUE "SHORT".
       01 WS-WORD-C PIC A(8) VALUE "SHORT".
       01 WS-WORD-D PIC A(8) VALUE "SHORT 15".

       01 WS-ALPHA-NUM-A PIC X(9) VALUE "ALPHA NUM".
       01 WS-ALPHA-NUM-B PIC X(9) VALUE "THIS IS AN ALPHA NUM".

       01 WS-EDITED-A PIC 99/99/9999 VALUE 01111995.
       01 WS-EDITED-B PIC $999,999,999.99 VALUE 1500000.
       01 WS-EDITED-C PIC $999,999,999.99 VALUE 1500000.99.
       01 WS-EDITED-D PIC $$$$,$$$,$$9.99 VALUE 1500000.99.
       01 WS-EDITED-E PIC $$$$,$$$,$$9.99 VALUE 1234567890.99.


       PROCEDURE DIVISION.

       DISPLAY " "
       
       DISPLAY "NUMERIC:"
       DISPLAY "WS-NUMBER-A: " WS-NUMBER-A
       DISPLAY "WS-NUMBER-B: " WS-NUMBER-B
       DISPLAY "WS-NUMBER-C: " WS-NUMBER-C
       DISPLAY "WS-NUMBER-D: " WS-NUMBER-D
       DISPLAY " "

       DISPLAY "ALPHABETIC:"
       DISPLAY "WS-WORD-A: <" WS-WORD-A ">"
       DISPLAY "WS-WORD-B: <" WS-WORD-B ">"
       DISPLAY "WS-WORD-C: <" WS-WORD-C ">"
       DISPLAY "WS-WORD-D: <" WS-WORD-D ">"
       DISPLAY " "

       DISPLAY "ALPHANUMERIC:"
       DISPLAY "WS-ALPHA-NUM-A: <" WS-ALPHA-NUM-A ">"
       DISPLAY "WS-ALPHA-NUM-B: <" WS-ALPHA-NUM-B ">"
       DISPLAY " "

       DISPLAY "WS-EDITED-A: " WS-EDITED-A   
       DISPLAY "WS-EDITED-B: " WS-EDITED-B
       DISPLAY "WS-EDITED-C: " WS-EDITED-C
       DISPLAY "WS-EDITED-D: " WS-EDITED-D
       DISPLAY "WS-EDITED-E: " WS-EDITED-E
       DISPLAY " "

       STOP RUN.
