       IDENTIFICATION DIVISION.
       PROGRAM-ID. TABLES.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ONE-DIMENTIONAL-TABLE.
           05 WS-CODES PIC X(4) VALUE "A000" OCCURS 5 TIMES.
       01 BI-DIMENTIONAL-TABLE.
           05 WS-PERSON OCCURS 2 TIMES.
               10 WS-NAME PIC A(5) VALUE "John".
               10 WS-HOBBIES OCCURS 3 TIMES.
                   15 WS-HOBBY PIC A(10) VALUE "singing".

       PROCEDURE DIVISION.
       MOVE '00010002000300040005' TO ONE-DIMENTIONAL-TABLE.
       DISPLAY "ONE-DIMENTIONAL-TABLE: " ONE-DIMENTIONAL-TABLE.
      *SUBSCRIPT to access table elements.
       DISPLAY "THIRD CODE: " WS-CODES(3).
       DISPLAY " ".

      *WORK WITH THE BI-DIMENTIONAL-TABLE 
       MOVE "John singing   tennis    baseball  " &
           "Dan  cooking   reading   swimming"
           TO BI-DIMENTIONAL-TABLE.

       DISPLAY "BI-DIMENTIONAL-TABLE: " BI-DIMENTIONAL-TABLE.
       DISPLAY "FIRST PERSON: " WS-PERSON(1).
       DISPLAY "SECOND PERSON: " WS-PERSON(2).
       DISPLAY " ".
       DISPLAY "FIRST PERSON'S NAME: " WS-NAME(1).
      *WS-HOBBY is inside WS-HOBBIES, which OCCURS 3 TIMES
      *WS-HOBBIES is inside WS-PERSON, which OCCURS 2 TIMES
      *WS-HOBBY(PERSON-INDEX, HOBBY-INDEX)
       DISPLAY "FIRST PERSON'S SECOND HOBBY: " WS-HOBBY(1,2).
       



       STOP RUN.
       END PROGRAM TABLES.
