       IDENTIFICATION DIVISION. 
       PROGRAM-ID. HELLO_WORLD.
       AUTHOR.     Eduardo Feria.
      *This is a comment in COBOL. 

       ENVIRONMENT DIVISION.

       DATA DIVISION.

       PROCEDURE DIVISION.
       
           DISPLAY "HELLO WORLD!"
       STOP RUN.
           
       END PROGRAM HELLO_WORLD.
       